2S/Discrete/Project1.tex
% Created 2024-02-12 Mon 14:28
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{placeins}
\usepackage{gensymb}
\usepackage{amsmath}
\usepackage{listings}
\lstset{frame=single, breaklines=true}
\author{Christian Johnson \& Aidan Andersen}
\date{\today}
\title{Project 1: Python Truth Tables}
\hypersetup{
 pdfauthor={Christian Johnson \& Aidan Andersen},
 pdftitle={Project 1: Python Truth Tables},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2.50 (Org mode 9.7-pre)}, 
 pdflang={English}}
\begin{document}

\maketitle
\newpage
\section*{Proof 1}
\label{sec:org56a9383}
$p\lor(\lnot q)$\newline
$(t\lor s)\implies(p\lor r)$\newline
$(\lnot r)\lor(t\lor s)$\newline
$\underline{p\implies(t\lor s)}$\newline
$(p\land r)\implies(q\lor r)$\newline\newline
This simplifies to:
\newline
p\lor(\lnot q)\newline
p\implies(p\lor r)\newline
\underline{p\implies(t\lor s)}\newline
(p\land r)\implies (q\lor r)
\newline\newline
\textbf{Given hypotheses:}
\newline
\indent\textbf{1. } $$p\lor (\lnot q)$$ \\
\indent\textbf{2. } $(t\lor s) \implies (p\lor r)$\\
\indent\textbf{3.} $(\lnot r) \lor (t\lor s)$\\
\indent\textbf{4.} $p \implies (q\lor r)$\\
\newline
\textbf{Claim:} $(p \land r) \implies (q\lor r)$\newline
\newline
\textbf{Proof:}
\begin{itemize}
\item Assume $p \land r$. \textit{(Claim)}
\item From 1., we have $p$. \textit{(Conjunction elimination)}
\item Apply hypothesis 4 to $p$, which implies $q\lor r$. \textit{(Modus Ponens)}
\item Since $r$ is also true, $q\lor r$ holds. \textit{(Disjunctive Syllogism)}
\item Therefore, $(p\land r)\implies (q\lor r)$ is established
\end{itemize}
\newline\newline
This conclusion can be shown in the truth table on the next 2 pages.
\newpage
\begin{lstlisting}[language=Python]
  variables=['p', 'q', 'r', 's', 't']
  expression1=lambda p,r: p and r
  expression2=lambda q,r: q or r
  expression3=lambda p,q,r: Implies(p&r,q|r)
  data=[]

  for p in (True, False):
      for q in (True, False):
          for r in (True, False):
              for t in (True, False):
                  for s in (True, False):
                      result1=expression1(p,r)
                      result2=expression2(q,r)
                      result3=expression3(p,q,r)
                      data.append([p,q,r,t,s,result1,result2,result3])
  df=pd.DataFrame(data, columns=['p','q','r','s','t','p and r','q or r','(p and r) implies (q or r)'])
  ConvertToLatex(df)
\end{lstlisting}


\newpage
\hspace{-2cm}\input{Project1Export1.tex}
\newpage
\section*{Proof 2}
\label{sec:org1bb2236}

$p\lor(\lnot q)$\\
$(t\lor s)\implies(p\lor r)$ \\
$(\lnot r)\lor(t\lor s)$ \\
$\underline{p\iff(t\lor s)}$\\
$(q\lor r)\implies(p\lor r)$\\
\newline\newline
This can be simplified to:
\newline
$p\lor(\lnot q)$ \\
$p\implies (p\lor r)$ \\
$\underline{(\lnot r)\lor(t\lor s)}$ \\
$(q\lor r)\implies(p\lor r)$\\
\newline\newline
\textbf{Given hypotheses:}\newline
\indent\textbf{1.} $p\lor(\lnot q)$\\
\indent\textbf{2.} $p\implies(p\lor r)$\\
\indent\textbf{3.} $(\lnot r)\lor(t\lor s)$\\
\textbf{Claim:} $(q\lor r)\implies(p\lor r)$
\textbf{Proof:}\newline
\begin{itemize}
\item Assume $q\lor r$.  \textit{(Claim)}
\item 
\end{document}